**step-1: Import packages**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**step-2: Create a DF using list**

In [4]:
names=['Ramesh','Suresh','Sathish']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

**step-3: I want to change the index**

In [5]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
pd.DataFrame(names,ids)
#pd.DataFrame(data,index,columns)

         0
A   Ramesh
B   Suresh
C  Sathish

**step-4: Add the columns**

In [6]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
cols=['Names']
pd.DataFrame(names,ids,cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

**step-5: Data and columns**

In [7]:
names=['Ramesh','Suresh','Sathish']
cols=['Names']
pd.DataFrame(names,columns=cols)

     Names
0   Ramesh
1   Suresh
2  Sathish

**step-6: multiple columns**

In [9]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
cols=['Names','Age']
df=pd.DataFrame(zip(names,age),
            columns=cols)
#pd.DataFrame(data,index)
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

**step-7: Add a new column to already existed df**

- in above first we have taken data 

- then created a dataframe

- now we want to add new data based on requirement

In [10]:
city=['Hyd','Pune','Blr']
df['City']=city
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [11]:
df['Marks']=[20,30,40]

In [12]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     20
1   Suresh   22  Pune     30
2  Sathish   24   Blr     40

**step-8: Update the column with new values**

In [15]:
df['Marks']=[200,300,400]

In [16]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

**step-9: create empty dataframe and add the columns**

In [18]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Blr']
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**step-10: Create a df using dictionary**

In [20]:
d={'Names':['Ramesh','Suresh','Sathish'],
  'Age':[20,22,24],
  'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [21]:
d={'Name':'Ramesh',
  'Age':20}
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [22]:
d={'Name':'Ramesh',
  'Age':20}
pd.DataFrame(d,index=[0])

     Name  Age
0  Ramesh   20

**step-11: Save the dataframe**

In [19]:
# file handling session
# directory//filename.ext
# filename.ext
# we are saving dataframes
# .csv or .xlsx

In [20]:
df=pd.DataFrame()

df.to_csv('data.csv')

In [21]:
df.to_csv(r'C:\Users\chinn\Documents\data.csv')

In [22]:
df.to_excel('data.xlsx')

**step-12: Read the dataframe**

In [29]:
# in order to read the data
# filename.ext
# open(mbox-short.txt).read()
# open (dummy.txt,mode='w').write('hello')

# data.csv    data.xlsx

In [27]:
import pandas as pd
import numpy as np

In [39]:
pd.read_csv('data.csv')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [40]:
d={'Names':['Ramesh','Suresh','Sathish'],
  'Age':[20,22,24],
  'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [41]:
df.to_csv('data.csv')

In [42]:
df.to_excel('data.xlsx')

In [43]:
pd.read_csv('data.csv')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [44]:
pd.read_excel('data.xlsx')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [45]:
d={'Names':['Ramesh','Suresh','Sathish'],
  'Age':[20,22,24],
  'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [ ]:
df.to.csv
pd.read_csv
df.to_csv
pd.read_csv

In [47]:
df.to_excel('data1.xlsx',index=False)

In [48]:
pd.read_excel('data.xlsx')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [49]:
#add one more  column marks to df
df['Marks']=[50,60,70]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     50
1   Suresh   22   Blr     60
2  Sathish   24  Pune     70

**step-13: Drop the column**

- labels

- axis

- index

- columns

- inplace

In [77]:
# if i want to drop a index
# i need to use index argument name
df.drop(index=1)

     Names  Age  city  Marks
0   Ramesh   20   Hyd     50
B  Sathish   24  Pune     70

In [78]:
df

     Names  Age  city  Marks
0   Ramesh   20   Hyd     50
1   Suresh   22   Blr     60
B  Sathish   24  Pune     70

In [81]:
#if i want to drop a index
# i need to use index argument name

df.drop(columns='Marks')

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
B  Sathish   24  Pune

In [83]:
df.drop(columns=['city','Marks'])

     Names  Age
0   Ramesh   20
1   Suresh   22
B  Sathish   24

In [84]:
df

     Names  Age  city  Marks
0   Ramesh   20   Hyd     50
1   Suresh   22   Blr     60
B  Sathish   24  Pune     70

In [ ]:
df.drop(index=1)
df.drop(columns='marks')
#====================================
df.drop('marks') # if i dont give argument lable
df.drop(1) # 1 become label
#====================================
# we need to provide axis
# axis=0 indicates index
# axis=1 indicates columns

In [85]:
df.drop('Marks')

# by default label='marks'
#if you want dont mention axis
# by default axis=0===? index

KeyError: "['Marks'] not found in axis"

In [86]:
df.drop('Marks',axis=0)

KeyError: "['Marks'] not found in axis"

In [87]:
df.drop('Marks',axis=1)

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
B  Sathish   24  Pune

**inplace**

- when we do the operation the result output is not overwriting

- means the original dataframe is same as it is.

- in order to do this we need use**inplace**

- by default inplace=False

- make**inplace=True** if you want overwrite the result

In [89]:
df.drop('Marks',axis=1,inplace=True)

In [90]:
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
B  Sathish   24  Pune

**step-14: Rename the column**

In [91]:
d={'City':'city'}  # {old:new}
#df.rename(<mapper>,<axis>,<inplace>)
df.rename(d,axis=1,inplace=True)

In [92]:
d={2:'B'}  # {old:new}
#df.rename(<mapper>,<axis>,<inplace>)
df.rename(d,axis=0,inplace=True)

In [93]:
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
B  Sathish   24  Pune

In [96]:
# create one more df
# x=1 to 10
# y= square x
# z= cube x
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),
             columns=['X','Y','Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len

- shape: df.shape

- size: df.size

- head: df.head

- tail: df.tail

- isnull: df.isnull

- dtypes: df.types

- info: df.info

In [97]:
len(df)

10

In [98]:
df.shape  # 10 rows 3 cols

(10, 3)

In [99]:
df.size

30

In [100]:
df.head()

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [101]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [102]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [103]:
df.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [104]:
df.dtypes

# if any cat columns occurs

X    int64
Y    int64
Z    int64
dtype: object

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

**step-15: select the columns**

In [106]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [107]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [109]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [110]:
type(df['X'])
# 1d

pandas.core.series.Series

In [111]:
type(df[['X','Y']])
# 2d

pandas.core.frame.DataFrame

In [112]:
df['X'].shape

(10,)

In [113]:
df[['X','Y']].shape

(10, 2)

In [114]:
df     # dataframe
df['Z']  # selecting one particular column
df['Z'].values# extracting the data
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [117]:
df     
df[['Y','Z']]  
df[['Y','Z']].values

array([[   1,    1],
       [   4,    8],
       [   9,   27],
       [  16,   64],
       [  25,  125],
       [  36,  216],
       [  49,  343],
       [  64,  512],
       [  81,  729],
       [ 100, 1000]])